// 1.
// 1 - C.Номера(индексы) элементов массива
// 2 - B. Название массива
// 3 - А. Элементы массива
//
// 2.
// В. Последовательно сравниваются значения соседних элементов и меняются местами элементы, если предыдущий больше последующего. Таким образом элементы с большим значением оказываются в конце списка, а с меньшим в начале.
//
// 3.
// Алгоритмизация – это…
// А. процесс разработки алгоритма для решения какой - либо задачи.
//
// 4. D. Может быть двусмысленным
//
// 5. E. Наглый алгоритм
//
// 6.
// A. операционный блок - 2
// B. начало(конец) алгоритма - 1
// C. цикл с параметром - 3
// D. логический(условный) блок - 4
// E. блок ввода / вывода - 5
//
// 7.
// 1 - B. START
// 2 - A. READ buy products
// 3 - D. WHILE (all products bought) buy products
// 4 - C. END